---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.NoPoints
source: html/7bbef7e2-44ac-abf4-51f0-4084369adeae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.NoPoints Property

No points were found in the file.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoPoints { get; }
```